---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.ExportRoomGeometry
source: html/1f40544f-1f6a-24d6-6256-8f9f61e6114a.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.ExportRoomGeometry Property

True to export Revit room geometry, false otherwise.
 Default value is true.

## Syntax (C#)
```csharp
public bool ExportRoomGeometry { get; set; }
```